angular.callbacks._0([
   {
       "title": "Begrüßung",
       "description": "Hier bekommt Ihr die Infos für den Tag.",
       "start": "2015-06-12T06:45:00Z",
       "speaker": "Eroeffnung"
   },
   {
       "title": "Keynote",
       "description": "Keynote",
       "start": "2015-06-12T07:00:00Z",
       "speaker": "Raphael Koellner"
   },

   {
       "title": "DynamicProxy",
       "description": "Mit DynamicProxy bringen Sie Magie in Ihre Projekte. Dabei handelt es sich um alles andere als um Hexerei. Wir werden Objekte und Interfaceimplementierungen dynamisch zur Laufzeit erzeugen. So können wir das Errorhandling oder Logging nahezu komplett aus unserer Anwendung ausgliedern und Standardisieren. Zur Veranschaulichung werden wir unsere Proxys in eine ASP.NET MVC Anwendung integrieren.",
       "start": "2015-06-12T08:05:00Z",
       "speaker": "Marco Griesshammer"
   },
   {
       "title": "Neues in Visual Studio 2015",
       "description": "Die Entwicklungsumgebung Visual Studio hat mit der Version 2015 das nächste große Update erfahren und wartet mit jeder Menge neuer Features auf. In dieser Session stellt Patric Boscolo die wichtigsten Neuerungen in und um Visual Studio 2015 vor und zeigt wie man diese produktiv in den Arbeitsalltag integrieren kann.",
       "start": "2015-06-12T08:05:00Z",
       "speaker": "Patric Boscolo"
   },
   {
       "title": "App-ocalypse Now - The dark side of your App",
       "description": "Cross-platform, Wiederverwendbarkeit, Performance. Welche Programmiersprache ist die Beste? C# natürlich. Oder vielleicht doch Java? Oder Objective-C, dessen Swift, oder gar JavaScript? Diese Themen beschäftigen Entwickler jeden Tag und werden gerne und oft auf Konferenzen diskutiert. Letztlich berühren sie aber nur einen kleinen Bereich der App-Entwicklung. Viele spannende Fragen werden nie gestellt, oder gar beantwortet. Was passiert mit der App, wenn sie im Store verfügbar ist? Auf welche Infos kann ich als Entwickler zugreifen - Statistiken, Fehlerberichte, Kundenkommentare? Wie komme ich an mein Geld? Und wieviel verdiene ich überhaupt? Dieser Talk blickt hinter die Kulissen von Google Play und dem Microsoft App Store. Die Sprecher stellen Gemeinsamkeiten und Untrschiede vor, zeigen was die beiden Welten jeweils gut machen, und wo sie voneinander lernen könnten.",
       "start": "2015-06-12T08:05:00Z",
       "speaker": "Tim Bourguignon"
   },

   {
       "title": "Legacy Code. Und jetzt?",
       "description": "Steckst du im Legacy-Sumpf? Ich zeige euch ein Vorgehen das euch erlaubt Schritt für Schritt den Legacy-Code loszuwerden ohne dabei die bestehende Funktionalität zu zerstören. Stell dir vor wieder Freude an Legacy-Projekten zu haben. Du lernst Methoden, Techniken und Tools kennen die dir erlauben Legacy Code zu detektieren, entschlüsseln, neue Funktionen hinzuzufügen und schlussendlich längerfristig zu verbessern. Kleine Schritte. Kein Big Bang. Begleite mich auf eine Reise aus dem Legacy-Sumpf.",
       "start": "2015-06-12T09:30:00Z",
       "speaker": "Daniel Marbach"
   },
   {
       "title": "DevOps - Entwickelst du noch oder lieferst du schon?",
       "description": "Zehn Releases am Tag - das ist die neue Devise. Wenn sie jetzt sagen, das brauche ich nicht oder das funktioniert bei uns nicht, dann sollten sie unbedingt diese Session besuchen. Wir zeigen ihnen wie auch ihr Projekt von kurzen Lieferzyklen profitieren kann und dass dies nicht nur für die großen Web-Sites funktioniert. Natürlich gibt es in diesem Kontext einige Herausforderungen, letztendlich brauchen wir für DevOps auch ganz neue Lösungsansätze, nicht nur Tools, sondern auch bereits bei der Implementierung. Wir zeigen diese Herausforderungen auf und wollen sie mit konkreten Lösungsansätze dazu inspirieren, dass sie über ganz neue Möglichkeiten nachdenken die auch ihr Geschäftsmodell erweitern können.",
       "start": "2015-06-12T09:30:00Z",
       "speaker": "Thomas Schissler"
   },
   {
       "title": "Hybride Apps mit Cordova, AngularJS und Ionic",
       "description": "Dank Apache Cordova ist es möglich, Ihr bestehendes Wissen zu HTML5, JavaScript und CSS3 auf mobile Apps anzuwenden. Nutzen Sie AngularJS von Google um Techniken wie MVC und Data Binding in den Browser zu bringen. Erfahren Sie in diesem Vortrag, wie Sie in durch den jüngsten Spross, dem Ionic Framework, ansprechende Oberflächen für iOS, Android und Windows Phone gestalten können. Statt PowerPoint erwartet Sie viel Live Coding. Johannes Hoppe wird zusammen mit Ihnen eine erste Ionic -Anwendung entwickeln.",
       "start": "2015-06-12T09:30:00Z",
       "speaker": "Johannes Hoppe"
   },

   {
       "title": "Zen of DataFlow - Die Daten sollen parallel fließen...",
       "description": "Unter dem Motto \"Zen of DataFlow\" zeigt Sebastian Achatz warum \"Async and await\" was für Mädchen ist und richtig parallel programmieren ganz anders geht. Das \"Wie\" zeigt dieser Talk ganz im Detail anhand vieler Beispiele aus der Praxis. Producer-Consumer heißt das Zauberwort mit dem Anwendungen zum \"Fliegen\" gebracht werden. Lasst euch in diesem Talk von richtigem parallelen \"DataFlow\" mitreißen!",
       "start": "2015-06-12T12:00:00Z",
       "speaker": "Sebastian Achatz"
   },
   {
       "title": "IoT - kann man das essen?",
       "description": "Alle Welt spricht von IoT, Cloud und totaler Vernetzung und abgesehen davon, das SkyNet seine helle Freude an unserer neu entfachten Datensammlungswut haben wird, müssen wir uns die Frage stellen, wie wir Daten sinnvoll erfassen und mit welchen Geräten wir dieses überhaupt tun. Denn das unserer Vorfahren Jäger und Sammler waren, haben wir schon längst nicht mehr im Blut. In diesem Vortrag werden wir uns einige der gängigsten IoT Boards anschauen und uns überlegen was wir damit anstellen können :)",
       "start": "2015-06-12T12:00:00Z",
       "speaker": "Holger Wendel"
   },
   {
       "title": "Von Siedlern und Entdeckern",
       "description": "\"Wo ist meine Änderung von gestern hin? Ich bin mir sicher, dass ich den Fix gestern eingecheckt habe.\" Kennen Sie das, wenn der Kollege Ihre Änderungen vom Vortag wieder zurückgenommen hat? Warum nur macht er das immer wieder? Auch dann noch, wenn Sie ihn darauf hinweisen, dass man erst einmal darüber reden sollte. Ich sage Ihnen, in meinem Vortrag, warum er das macht - er kann nicht anders, es ist seine Natur.",
       "start": "2015-06-12T12:00:00Z",
       "speaker": "Jan Fellien"
   },

   {
       "title": "Codeanalysen mit Roslyn",
       "description": "Mit Roslyn ist es erstmals möglich einen Blick in den Compiler zu werfen, als auch den Code mit Roslyn zu bearbeiten und zu analysieren. Visual Studio 2015 unterstützt dieses Szenario vollständig und per NuGet und VSIX können eigene Analysen installiert werden. Dadurch erhält die .NET Entwicklergemeinde die Möglichkeit sich eigene Codeanalysen zu schreiben als auch zu verwenden mit dem neuen Visual Studio. Sehen Sie in dieser Session wie mit Roslyn Code analysiert werden kann, wie Roslyn dabei vorgeht und wie sich das neue Visual Studio dabei verhält.",
       "start": "2015-06-12T13:25:00Z",
       "speaker": "Christian Giesswein"
   },
   {
       "title": "IoT und Big Data in der Praxis.",
       "description": "Internet of Things und Big Data sind derzeit in aller Munde. Aber wie steht es um die Umsetzungsmöglichkeiten. In diesem Vortrag wird ein konkretes Kundenszenario zum Aufbau einer Smart Factory mit der Möglichkeit von u.a. Predictive Maintenance, Monitoring, Remote Control vorgestellt. Im Detail wird das erfolgreiche Zusammenspiel von Microsoft-Diensten, wie z.B. Event Hub oder Machine Learning, sowie die Möglichkeiten zur Analyse von Inflight-Daten vorgestellt.",
       "start": "2015-06-12T13:25:00Z",
       "speaker": "Robert Eichenseer"
   },
   {
       "title": "Houston – Wir haben (k)ein Problem!",
       "description": "Ein aktueller Mittelklassewagen produziert mehr Daten als die Apollo 11, welche die ersten Menschen auf den Mond schoss.Fakt ist: Seit der Mondlandung hat sich die Power digitaler Systeme in unserem Alltag potenziert, was zu einer wahren Informationsflut führt. Dank der immer stärker wachsenden Vernetzung der analogen Welt ist die Tendenz weiter steigend.In ihrer Session zeigen Ulrike und Marco Wege auf, komplizierte digitale Informationen zu simplifizieren und verständlich zu visualisieren. Außerdem zeigen sie, wie sich Interaktionsschnittstellen homogen in das Visualisierungskonstrukt einfügen lassen, ohne den Benutzer zu verwirren oder den Informationsfluss zu zerstören. An Hand von praktischen Beispielen werden konkrete Ansätze aufgezeigt, wie dank C#/XAML auch ohne teure Zusatzkomponenten, Windows Store Apps erstellt und somit ansprechende Informationsanzeigen nicht nur für klassische mobile Devices, sondern auch für große Leitstände realisiert werden.",
       "start": "2015-06-12T13:25:00Z",
       "speaker": "Marco Richardson"
   },

   {
       "title": "Softwareevolution - bestehenden Code zweifelsfrei refaktorisieren",
       "description": "Allen Orts hört man es rauschen: „Clean Code ist wichtig.“ „TDD ist das Maß der Dinge.“ Es stellt sich nur die Frage wie man jene Prinzipien in bestehenden Code einfügen kann. Wie finde ich die Stellen an denen ein Refactoring wirklich sinnvoll wäre und wie nehme ich diese Änderungen vor, ohne die Stabilität der Software zu gefährden. In dieser Session sehen wir uns an mit welchen Hilfsmitteln des Visual Studios zunächst Code analysiert und anschließend refaktorisiert werden kann. Es wird erläutert wie hohe Abhängigkeitsgrade durchbrochen und die Architektur einer Anwendung in eine lose gekoppelte Struktur überführt wird.",
       "start": "2015-06-12T14:50:00Z",
       "speaker": "Hendrik Loesch"
   },
   {
       "title": "Bring your own Schufa!",
       "description": "Überall werden heute Daten gesammelt, aber wie können solche riesigen Datenmengen analysiert und aus ihnen eine zuverlässige Aussage über die Zukunft erstellt werden? Mit Machine Learning bietet Microsoft innerhalb von Azure einen neuen Dienst an, der genau das ermöglicht. Lassen Sie uns selbst ermitteln, wem wir Geld leihen können und wem lieber nicht. Hierzu nutzen wir statistische Daten, erstellen ein Modell zur prädiktiven Analyse und veröffentlichen dieses als Web-Service.",
       "start": "2015-06-12T14:50:00Z",
       "speaker": "Jan Schweda"
   },
   {
       "title": "Cortana, verbessere meine App!",
       "description": "Mit Windows Phone 8.1 wurde die persönliche Assistentin Cortana vorgestellt und ist seit dem Dezember 2013 auch in Deutschland als Alpha Version verfügbar. Die Gerüchteküche brodelt, kommt Cortana mit Windows 10 auf den Desktop und bald auch auf die Xbox? Doch was für den Nutzer ein nettes Gimmick ist kann für den Appentwickler einen entscheidenden Vorsprung darstellen. Wie Cortana funktioniert und wie sie zum Aufrufen und zur Interaktion mit der eigenen App verwendet werden kann zeigt der Vortrag mit Hilfe verschiedener Beispiele. Zusammen mit Cortana wird das notwendige Know-How mit reichlich Humor vermittelt.",
       "start": "2015-06-12T14:50:00Z",
       "speaker": "Alexander Witkowski"
   }
]);
