callback([{"title":"Smartwatch Hacking","description":"Samsung Gear, Pebble, iWatch und andere \"smarte\" Uhren bringen neue Möglichkeiten und Herausforderungen für Entwickler/innen. In diesem Vortrag zeigt Robert, wie sogenannte Watch Faces und Watch Apps programmiert werden können und wie die Verbindung zwischen Smartphone und Smartwatch auf den unterschiedlichen Plattformen funktioniert.","start":"2014-11-18T08:00:00Z","speaker":"Virkus, Robert"},{"title":"A/B Testing und Optimierung für den kleinen Bildschirm","description":"A/B Testing und Conversion Optimierung haben sich über die letzten Jahre dank einfach zu nutzender Tools einer wachsenden Beliebtheit erfreut.60% aller Apps im App Store wurde nie heruntergeladen, 80%-90% aller heruntergeladenen Apps werden nur einmal benutzt und dann gelöscht. Wenig intuitive Nutzerführung ist häufig eines der größten Probleme. Es gibt im mobile Bereich viel Optimierungsbedarf und die Herausforderungen sind denen des Desktop häufig sehr unterschiedlich. Wir möchten in unserem Vortrag einige der wirkungsvollsten Optimierungshebel zeigen, die den Download, die Nutzung und Conversions bei Apps verbessern können.","start":"2014-11-18T09:45:00Z","speaker":"Urff, Toby"},{"title":"Continuous Integration für Android - Ein Bericht aus dem mobilen Alltag","description":"In den letzten Jahren ist die Mobile-Entwicklungsbranche erwachsen geworden. Bei der fortschreitenden Professionalisierung ist Continuous Integration ein beliebtes Buzzword. Ein Beispielszenario, in dem ein Continuous Integration Setup hilft, ist die von Kupferwerk entwickelte App für maxdome. Nach dem initialen Launch ging die Entwicklung nahtlos weiter mit regelmäßigen Updates der App im vier Wochen-Rhythmus. In dem Vortrag wird beschrieben wie automatisierte Tests der App uns helfen Regressionen zu vermeiden und Änderungen selbstbewusst und mit kurzen Zyklen in der Qualitätskontrolle zu implementieren. Automatische Tests gegen die verschiedenen Entwicklungsphasen des Kundenbackends stellen sicher das Erweiterungen hier nicht zu Problemen in der Liveapp führen. Unser Continuous Integration Server baut und testet dabei nicht nur unsere Apps sondern veröffentlicht auch automatische neue Versionen unserer Bibliotheken in ein Mavenrepository und stellt die fertigen Apps unseren Kunden und Testern zum Download zur Verfügung. Der Vortrag beschreibt unser laufendes Setup und gibt Einblicken in die Erfahrungen die wir beim Einführen der verschiedenen Technologien gemacht haben.","start":"2014-11-18T09:45:00Z","speaker":"Leidgens, Janusz"},{"title":"Continuous Delivery","description":"Die Entwicklung Mobiler Anwendungen ist ein sehr schnelllebiges Geschäft.Die Session gewährt einen Überblick über das Application Lifecycle Management von mobilen Anwendungen in einem verteilten, stark heterogenen Umfeld, in dem sowohl mobile Webanwendungen, portable Anwendungen mit PhoneGap oder Titanium sowie Native Apps zum Einsatz kommen. Außerdem wird gezeigt, wie diese ihren Weg bis zum Endanwender finden.Dazu werden folgende verwendet:","start":"2014-11-18T10:45:00Z","speaker":"Keil, Werner"},{"title":"Hybride Apps mit Cordova, AngularJS und Ionic","description":"Dank Apache Cordova ist es möglich, Ihr bestehendes Wissen zu HTML5, JavaScript und CSS3 auf mobile Apps anzuwenden. Nutzen Sie AngularJS von Google, um Techniken wie MVC und Data Binding in den Browser zu bringen. Erfahren Sie in diesem Vortrag, wie Sie mit dem jüngsten Spross, dem Ionic Framework, ansprechende Oberflächen für iOS, Android und Windows Phone gestalten können. Statt PowerPoint erwartet Sie viel Live Coding. Johannes Hoppe wird zusammen mit Ihnen eine erste hybride Anwendung entwickeln.","start":"2014-11-18T10:45:00Z","speaker":"Hoppe, Johannes"},{"title":"Introduction to Android Wear","description":"In this session, I will give an overview of Android Wear and how to integrate it in your product strategy. We will look at the underlying design principles and discuss a number of use cases for apps that connect to wearable devices. After that, we will take a look at the some code examples and learn how to use the Android Wear SDK. This talk is for designers and developers alike.","start":"2014-11-18T12:30:00Z","speaker":"Friese, Peter"},{"title":"Mobile Web Entwicklung mit Apache DeviceMap","description":"Das Wachstum an Mobiltelefonen, Tablets und ähnlichen Geräten, die den Markt geradezu überschwemmen, erleben wir Tag für Tag. \nDie Spezifikation jedes Einzelnen genau zu verfolgen, ist ein Knochenjob. Diese Mühe kann reduziert werden, wenn zur Verbesserung des Device Description Repository – kurz DDR - beigesteuert wird und Anwender dieses selbst verwalten können.\nApache DeviceMap enstand als Kooperation von OpenDDR und anderen, um ein umfassendes Open Source Daten-Repository mit Geräteinformationen, Bilder und andere relevante Informationen für alle Arten von mobilen Geräten zu schaffen, Smartphones, Tablets, Smart-TV, u.dgl.Das Projekt begann im Januar 2012, im Herbst 2012 wurden DDR APis für Java und .NET von OpenDDR beigesteuert. Die nächsten Schritte sind ein gemeinschaftliches Device Repository, eine Speicher-Struktur, die langfristige Erhaltung und Pflege dieser Daten durch die Apache Gemeinde erlaubt, unter Nutzung geläufiger Formate, wahrscheinlich JSON und / oder XML.","start":"2014-11-18T12:30:00Z","speaker":"Keil, Werner"},{"title":"Social Plug-Ins mit HTML5 und JavaScript","description":"Hier lernen Sie die vielfältigen Möglichkeiten der Entwicklung von Social-Plug-Ins für alle gängigen Plattformen mit nur einer Programmiersprache kennen. Sie steigen mit den Grundlagen des Intel XDK ein und werden dann mit den wichtigsten Frameworks und Vorgehensweisen vertraut. Mit diesen Infos steigen Sie rasch auf zum versierten App-Entwickler und -Designer.","start":"2014-11-18T13:30:00Z","speaker":"Biswanger, Gregor"},{"title":"Xamarin for iOS and Android Applications","description":"'This session will cover how to get started building iOS and Android applications with C# and .NET using Xamarin. We’ll discuss the fundamentals of mobile development on each platform and how Xamarin fits in. Then, we’ll discuss how Xamarin works to produce native iOS and Android applications, and walk through an example showing how to build an application that reuses C# code.","start":"2014-11-18T13:30:00Z","speaker":"James, Mike"},{"title":"Android 5.0 Lollipop","description":"Das neue Android 5.0 ist ein großer Schritt für Nutzer und Entwickler - vermutlich das größte Android Update überhaupt. Im November 2014 wurde die finale Version von Android 5.0 mit dem Beinamen Lollipop veröffentlicht. Auch sind erste Tablets und Smartphone mit dieser Version inzwischen verfügbar. Für Entwickler macht es daher umso mehr Sinn sich diese Version jetzt näher zu betrachten.\n \nDie schillerndste Neuerung ist natürlich Material Design. Wir schauen uns an wie man als Entwickler die nächste UI Generation für sich nutzt. Mit dem neuen Material Theme erhalten Apps modernisierte UI Komponenten, die sehr einfach an die eigene Farbpalette angepasst werden kann. Sehr interessant ist zudem die mächtige RecyclerView als bessere List- und Gridview mit wesentlich mehr Flexibilität. Und natürlich dürfen Animationen auch nicht bei der Betrachtung fehlen.\n \nDas zweite einschneidende Update ist eine komplett neue Runtime: die ART genannte Lösung führt Apps durch neue Compiler und Garbage Collection Techniken schneller aus bietet weitere Vorteile. \n Darüber hinaus gibt es noch viele weitere Neuigkeiten zu entdecken, die wir nur exemplarisch beleuchten können. Denn wir wollen uns auch noch anschauen, wie es gelingt kompatibel zu alten Android Versionen zu bleiben und dennoch neue Features zu nutzen, z.B. mit den neuen Support Libraries.","start":"2014-11-18T14:30:00Z","speaker":"Junginger, Markus"},{"title":"Integration von Payment in Apps","description":"Mobile Payment wird zu einem der wichtigsten Themen im E-Commerce. Auch wenn die Akzeptanz beim Endkunden nur langsam steigt, wird ein stetig wachsender Anteil an Waren und Dienstleistungen mobil bezahlt. Um nicht beträchtlichen Teil seiner Einnahmen direkt an den Betreiber des Mobilfunk-Betriebssystems abzutreten, muss man für eigene Zahlungsmöglichkeiten sorgen und beispielsweise In-App-Payments integrieren.","start":"2014-11-18T14:30:00Z","speaker":"Lobacher, Patrick"},{"title":"Software-Lizenzrecht für Entwickler – warum es sich manchmal lohnt das Kleingedruckte zu lesen","description":"Im Dialog zwischen Projektleiter und Juristin werden die wichtigsten Fragen zum Thema Software-Lizenzen anhand von Beispielen aus der Praxis erläutert und gelöst. Verständlich, einfach und ohne Fachchinesisch werden wichtige Probleme im Rahmen von Softwareentwicklung besprochen.Wer liest schon AGBs? Wer kümmert sich um Nutzungsbestimmungen? Wer schreibt all seinen Code selbst? Wer kennt seine Rechte und die Folgen von falschem Handeln? Wenn ich eine neue Software für ein Projekt benötigte, dann nehme ich natürlich die mit der optimalen Funktionalität und nicht mit dem passenden rechtlichen Lizenzregelungen. Was vielen nicht bewusst ist, diese Einstellung kann im schlimmsten Fall viel Geld kosten, denn die Strafe für unberechtigte Lizenznutzung ist in der Regel die Zahlung von Schadensersatz. Abhängig von den Umständen kann dies von der scheinbar unerheblichen Zahlung der geschuldeten Lizenzgebühr bis hin zur Abgabe des gesamten erzielten Gewinns oder sogar dem Ersatz des entgangenen Gewinns des Urhebers führen.  Um dies zu vermeiden gilt es sich frühzeitig mit dem ungeliebten Thema auseinanderzusetzen. Welche Software-Lizenzen sind die häufigsten? Welche bekannten Programme, Plattformen und  Bibliotheken arbeiten damit? Woher weiß ich, welche die richtige für meine Software ist und welche kann ich gefahrlos für mein Unternehmen verwenden? Ist Open Source wirklich offen für Alle und Alles? Was habe ich als Entwickler mit der BildschArbV zu tun?","start":"2014-11-18T16:00:00Z","speaker":"Kilián, Antje"}]);